In [10]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
df = pd.read_csv("Automobile_data.csv", index_col=0)

# Exercise 1 Verilen veri kümesinden ilk ve son beş satırı yazdırın

In [4]:
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [4]:
df.tail()

,Unnamed: 0,Unnamed: 0.1,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,56,56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,57,57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,58,58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,59,59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,60,60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

# Exercise 2 Veri kümesini temizleyin ve CSV dosyasını güncelleyin

In [5]:
df.isnull().sum()

Unnamed: 0          0
Unnamed: 0.1        0
index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

In [5]:
df = pd.read_csv("Automobile_data.csv", na_values={
'price':["?","n.a"],
'stroke':["?","n.a"],
'horsepower':["?","n.a"],
'peak-rpm':["?","n.a"],
'average-mileage':["?","n.a"]})

df

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...,...
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

# Exercise 3 En pahalı araba şirketi adını bulun
En pahalı otomobilin şirket adını ve fiyatını yazdırın.

In [7]:
df['price'].max()

45400.0

In [8]:
df.price

0     13495.0
1     16500.0
2     16500.0
3     13950.0
4     17450.0
       ...
56     7975.0
57     7995.0
58     9995.0
59    12940.0
60    13415.0
Name: price, Length: 61, dtype: float64

In [9]:
df[df.price == df['price'].max()]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0

In [14]:
max_price = df[['company', 'price']][df.price == df['price'].max()]
max_price

          company    price
35  mercedes-benz  45400.0

In [17]:
# veya

max_price = df[df.price == df['price'].max()][['company', 'price']]
max_price

          company    price
35  mercedes-benz  45400.0

# Exercise 4 Tüm Toyota Cars ayrıntılarını yazdır

In [36]:
df.groupby('company')['price'].sum()

company
alfa-romero       46495.0
audi              65570.0
bmw              163280.0
chevrolet         18021.0
dodge             12606.0
honda             30585.0
isuzu              6785.0
jaguar           103800.0
mazda             48274.0
mercedes-benz    140160.0
mitsubishi        26756.0
nissan            41445.0
porsche           71056.0
toyota            57518.0
volkswagen        33740.0
volvo             26355.0
Name: price, dtype: float64

In [12]:
df[df.company == "toyota"]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

In [8]:
df.groupby("company").get_group("toyota")

# bu da diğer yöntem

,Unnamed: 0,Unnamed: 0.1,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,48,48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,49,49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,50,50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,51,51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,52,52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,53,53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,54,54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

# Exercise 5 Şirket başına toplam araba sayısı

In [38]:
df.company.values

array(['alfa-romero', 'alfa-romero', 'alfa-romero', 'audi', 'audi',
       'audi', 'audi', 'bmw', 'bmw', 'bmw', 'bmw', 'bmw', 'bmw',
       'chevrolet', 'chevrolet', 'chevrolet', 'dodge', 'dodge', 'honda',
       'honda', 'honda', 'isuzu', 'isuzu', 'isuzu', 'jaguar', 'jaguar',
       'jaguar', 'mazda', 'mazda', 'mazda', 'mazda', 'mazda',
       'mercedes-benz', 'mercedes-benz', 'mercedes-benz', 'mercedes-benz',
       'mitsubishi', 'mitsubishi', 'mitsubishi', 'mitsubishi', 'nissan',
       'nissan', 'nissan', 'nissan', 'nissan', 'porsche', 'porsche',
       'porsche', 'toyota', 'toyota', 'toyota', 'toyota', 'toyota',
       'toyota', 'toyota', 'volkswagen', 'volkswagen', 'volkswagen',
       'volkswagen', 'volvo', 'volvo'], dtype=object)

In [9]:
df.company.value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
volkswagen       4
audi             4
mitsubishi       4
mercedes-benz    4
chevrolet        3
alfa-romero      3
porsche          3
isuzu            3
honda            3
jaguar           3
volvo            2
dodge            2
Name: company, dtype: int64

# Exercise 6 Her şirketin Higesht fiyat arabasını bulun

In [14]:
df.groupby("company")["price"].max()

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

In [14]:
cmax = df.groupby("company")[["company","price"]].max()
cmax

# outputta bu şekilde istediği için company'i de çektik.
  # ben olsam aşağıdaki gibi yaparım.

                     company    price
company
alfa-romero      alfa-romero  16500.0
audi                    audi  18920.0
bmw                      bmw  41315.0
chevrolet          chevrolet   6575.0
dodge                  dodge   6377.0
honda                  honda  12945.0
isuzu                  isuzu   6785.0
jaguar                jaguar  36000.0
mazda                  mazda  18344.0
mercedes-benz  mercedes-benz  45400.0
mitsubishi        mitsubishi   8189.0
nissan                nissan  13499.0
porsche              porsche  37028.0
toyota                toyota  15750.0
volkswagen        volkswagen   9995.0
volvo                  volvo  13415.0

In [15]:
cmax = df.groupby("company")[["price"]].max()
cmax

                 price
company
alfa-romero    16500.0
audi           18920.0
bmw            41315.0
chevrolet       6575.0
dodge           6377.0
honda          12945.0
isuzu           6785.0
jaguar         36000.0
mazda          18344.0
mercedes-benz  45400.0
mitsubishi      8189.0
nissan         13499.0
porsche        37028.0
toyota         15750.0
volkswagen      9995.0
volvo          13415.0

# Exercise 7 Her araba yapım şirketinin ortalama kilometresini bulun

In [58]:
df.head(10)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
5,5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
6,6,audi,wagon,105.8,192.7,ohc,five,110,19,18920.0
7,9,bmw,sedan,101.2,176.8,ohc,four,101,23,16430.0
8,10,bmw,sedan,101.2,176.8,ohc,four,101,23,16925.0
9,11,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0

In [17]:
df.groupby("company")["average-mileage"].mean()

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

In [16]:
cmean = df.groupby("company")[["company","average-mileage"]].mean()
cmean

# company, numerik olmayan değer olduğu için .mean() bunu gözardı etti. ve resultta sütun olarak getirmedi.

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

# Exercise 8 Tüm arabaları Fiyat sütununa göre sırala

In [31]:
df.sort_values(by="price", ascending=False)

# Na position parametresi default olarak "last" olduğundan ascending de yapsan descending de yapsan tüm NaN veriler sonda sıralanıyor.

,Unnamed: 0,Unnamed: 0.1,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,35,35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,11,11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,34,34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,46,46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,12,12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
...,...,...,...,...,...,...,...,...,...,...,...,...
27,27,27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
13,13,13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
22,22,22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,23,23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
47,47,47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN

# Exercise 9 Aşağıdaki koşulları kullanarak iki veri çerçevesini birleştirin
Aşağıdaki iki sözlüğü kullanarak iki veri çerçevesi oluşturun.

In [3]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}

In [4]:
GC=pd.DataFrame(GermanCars)
JC=pd.DataFrame(japaneseCars)

In [79]:
GC

    Company   Price
0      Ford   23845
1  Mercedes  171995
2       BMV  135925
3      Audi   71400

In [80]:
JC

       Company  Price
0       Toyota  29995
1        Honda  23600
2       Nissan  61500
3  Mitsubishi   58900

In [77]:
pd.concat([GC, JC], axis=0, ignore_index = False)

       Company   Price
0         Ford   23845
1     Mercedes  171995
2          BMV  135925
3         Audi   71400
0       Toyota   29995
1        Honda   23600
2       Nissan   61500
3  Mitsubishi    58900

In [5]:
pd.concat([GC, JC], axis=0, ignore_index = True)

# ignore_index = True farkı.

       Company   Price
0         Ford   23845
1     Mercedes  171995
2          BMV  135925
3         Audi   71400
4       Toyota   29995
5        Honda   23600
6       Nissan   61500
7  Mitsubishi    58900

In [6]:
pd.concat([GC, JC], keys=['GermanCars', 'japaneseCars'], axis=0, ignore_index = False)

# keys belirleyince onları grup ismi olarak index'e koydu. ignore_index = True demediğimiz için de indexler olduğu gibi kaldı

                    Company   Price
GermanCars   0         Ford   23845
             1     Mercedes  171995
             2          BMV  135925
             3         Audi   71400
japaneseCars 0       Toyota   29995
             1        Honda   23600
             2       Nissan   61500
             3  Mitsubishi    58900

In [76]:
pd.concat([GC, JC], keys=['GermanCars', 'japaneseCars'], axis=0, ignore_index = True)

# ignore index yapınca (keysler dahil) önceki belirlenen indexleri gözardı etti ve indexleri tamamen kendi otomatik olarak verdi.

       Company   Price
0         Ford   23845
1     Mercedes  171995
2          BMV  135925
3         Audi   71400
4       Toyota   29995
5        Honda   23600
6       Nissan   61500
7  Mitsubishi    58900

In [34]:
GC =pd.DataFrame(GermanCars)
JC =pd.DataFrame(japaneseCars)

In [35]:
GC

    Company   Price
0      Ford   23845
1  Mercedes  171995
2       BMV  135925
3      Audi   71400

In [36]:
JC

       Company  Price
0       Toyota  29995
1        Honda  23600
2       Nissan  61500
3  Mitsubishi   58900

In [37]:
pd.concat([GC,JC], keys=["Germany","Japan"])

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

# Exercise 10: Aşağıdaki koşulu kullanarak iki veri çerçevesini birleştirin

Aşağıdaki iki Dikt'i kullanarak iki veri çerçevesi oluşturun, İki veri çerçevesini birleştirin ve ikinci veri çerçevesini ilk veri çerçevesine yeni bir sütun olarak ekleyin.

In [12]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

In [13]:
CP =pd.DataFrame(Car_Price)
CH =pd.DataFrame(car_Horsepower)

In [40]:
CP

  Company   Price
0  Toyota   23845
1   Honda   17995
2     BMV  135925
3    Audi   71400

In [41]:
CH

  Company  horsepower
0  Toyota         141
1   Honda          80
2     BMV         182
3    Audi         160

In [43]:
pd.merge(CP,CH, on="Company")

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160

In [ ]:
Car_Price2 = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi', 'Tofaş', 'AlfaRomeo'], 'Price': [23845, 17995, 135925 , 71400, 10000, 25000]}
Car_Horsepower2 = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

In [91]:
CP2 = pd.DataFrame(Car_Price2)
HP2 = pd.DataFrame(Car_Horsepower2)

In [92]:
CP2

     Company   Price
0     Toyota   23845
1      Honda   17995
2        BMV  135925
3       Audi   71400
4      Tofaş   10000
5  AlfaRomeo   25000

In [93]:
HP2

  Company  horsepower
0  Toyota         141
1   Honda          80
2     BMV         182
3    Audi         160

In [95]:
pd.merge(CP2,HP2,on="Company", how='outer')

     Company   Price  horsepower
0     Toyota   23845       141.0
1      Honda   17995        80.0
2        BMV  135925       182.0
3       Audi   71400       160.0
4      Tofaş   10000         NaN
5  AlfaRomeo   25000         NaN